examples/dfLowMachFoam/twoD_tripleFlame/H2/torchSolver/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           on;
CanteraMechanismFile "ES80_H2-7-16.yaml";
transportModel "Mix";
odeCoeffs
{
    "relTol"   1e-6;
    "absTol"   1e-10;
}
inertSpecie        "N2";
zeroDReactor
{
    //cvorcp "UV";
}
torch on;
torchModel "modelName.pt";

torchParameters
{
    Xmu
    (
        1933.118541482812
        1.2327983023706526
        -5.705591538151852
        -6.446971251373195
        -4.169802387800032
        -6.1200334699867165
        -4.266343396329115
        -2.6007437468608616
        -0.4049762774428252
    );

    Xstd
    (
        716.6568054751183
        0.43268544913281914
        2.0857655247141387
        2.168997234412133
        2.707064105162402
        2.2681157746245897
        2.221785173612795
        1.5510851480805254
        0.30283229364455927
    );

    Ymu
    (
        6381847.837202463
        4.751063937334583e-14
        175072.98234441387
        125434.41067566245
        285397.9376620931
        172924.8443087139
        -97451.53428068386
        -7160.953630852251
        -9.791262408691773e-10
    );

    Ystd
    (
        6396799.801910002
        1.3523423408265769e-10
        179830.51132577812
        256152.83860126554
        285811.9455262339
        263600.5448448552
        98110.53711881173
        11752.979335965118
        4.0735353885293555e-09
    );
}
// ************************************************************************* //
